lab1/fibonacciservice.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.2 git-revision#3d0bba4. -->
<!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 2.3.2 git-revision#3d0bba4. -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.example.lab1.vislab.iwi.hska.de/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://ws.example.lab1.vislab.iwi.hska.de/" name="FibonacciServiceImplService">
   <types>
      <xsd:schema>
         <xsd:import namespace="http://ws.example.lab1.vislab.iwi.hska.de/" schemaLocation="http://localhost:4434/fibonacciservice?xsd=1" />
      </xsd:schema>
   </types>
   <message name="getFibonacci">
      <part name="parameters" element="tns:getFibonacci" />
   </message>
   <message name="getFibonacciResponse">
      <part name="parameters" element="tns:getFibonacciResponse" />
   </message>
   <portType name="FibonacciService">
      <operation name="getFibonacci">
         <input wsam:Action="http://ws.example.lab1.vislab.iwi.hska.de/FibonacciService/getFibonacciRequest" message="tns:getFibonacci" />
         <output wsam:Action="http://ws.example.lab1.vislab.iwi.hska.de/FibonacciService/getFibonacciResponse" message="tns:getFibonacciResponse" />
      </operation>
   </portType>
   <binding name="FibonacciServiceImplPortBinding" type="tns:FibonacciService">
      <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
      <operation name="getFibonacci">
         <soap:operation soapAction="" />
         <input>
            <soap:body use="literal" />
         </input>
         <output>
            <soap:body use="literal" />
         </output>
      </operation>
   </binding>
   <service name="FibonacciServiceImplService">
      <port name="FibonacciServiceImplPort" binding="tns:FibonacciServiceImplPortBinding">
         <soap:address location="http://localhost:4434/fibonacciservice" />
      </port>
   </service>
</definitions>